app/controllers/artists_controller.rb

SELECT  "artists".* FROM "artists" WHERE "artists"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def show
    @artist = Artist.find_by(id: params[:id])

SELECT  "artists".* FROM "artists" WHERE "artists"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
---
  def edit
    @artist = Artist.find(params[:id])